ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
    // Application RAM start address
    uint32_t ram_start = 0;

    // Configure BLE stack
    if ( NRF_SUCCESS != nrf_sdh_ble_default_cfg_set( BLE_CONN_CFG_TAG, &ram_start ))
    {
        // Further actions on error... 
        error_handler();
    }

    // Enable BLE stack
    if ( NRF_SUCCESS != nrf_sdh_ble_enable( &ram_start ))
    {
        // Further actions on error... 
        error_handler();
    }
    
    // Register BLE event callback
    // ZIGA: An observer is essentially a piece of code that listens for events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, BLE_EVENT_PRIORITY, ble_evt_hndl, NULL);

    return status;
}



// Init GAP
static ret_code_t gap_init(void)
{
    ret_code_t                  status          = NRF_SUCCESS;
    ble_gap_conn_params_t       gap_conn_params = {0};
    ble_gap_conn_sec_mode_t     security_mode   = {0};

    // Use no security
    BLE_GAP_CONN_SEC_MODE_SET_OPEN( &security_mode );

    // Set the device name
    if ( NRF_SUCCESS != sd_ble_gap_device_name_set( &security_mode, (const uint8_t*) GAP_DEVICE_NAME, strlen(GAP_DEVICE_NAME)))
    {
        // Further actions on error... 
        error_handler();
    }

    // Set the apperance
    // BLE_APPEARANCE_GENERIC_COMPUTER
    if ( NRF_SUCCESS != sd_ble_gap_appearance_set( BLE_APPEARANCE_GENERIC_GLUCOSE_METER ))  
    {
        // Further actions on error... 
        error_handler();
    }

    // Set up GAP
    gap_conn_params.min_conn_interval   = MSEC_TO_UNITS( GAP_MIN_CONN_INTERVAL_MS, UNIT_1_25_MS );
    gap_conn_params.max_conn_interval   = MSEC_TO_UNITS( GAP_MAX_CONN_INTERVAL_MS, UNIT_1_25_MS );
    gap_conn_params.slave_latency       = GAP_SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout    = MSEC_TO_UNITS( GAP_SUPERVISION_TIMEOUT_MS, UNIT_10_MS );

    // Set the PPCP - Peripheral Prefered Connection Parameters
    if ( NRF_SUCCESS != sd_ble_gap_ppcp_set( &gap_conn_params ))
    {
        // Further actions on error... 
        error_handler();        
    }

    return status;
}


// Init GATT
static ret_code_t gatt_init(void)
{
    ret_code_t status = NRF_SUCCESS;

    if ( NRF_SUCCESS != nrf_ble_gatt_init( &m_gatt, NULL ))
    { 
        // Further actions on error... 
        error_handler();   
    }

    return status;
}



// Advertisement handler
static void adv_evt_hndl(ble_adv_evt_t ble_adv_evt)
{

    switch (ble_adv_evt)
    {
        // Advertisement START
        case BLE_ADV_EVT_FAST:
           
            //bsp_board_led_on( BSP_BOARD_LED_0 );

            break;
        
        // Advertisement STOP
        case BLE_ADV_EVT_IDLE:

            //bsp_board_led_off( BSP_BOARD_LED_0 );

            break;

        default:
            break;
    }
}

// Init advertisment
static ret_code_t advertisement_init(void)
{
    ret_code_t              status   = NRF_SUCCESS;
    ble_advertising_init_t  adv_init = {0};

    // Set up advertising parameters
    adv_init.advdata.name_type              = BLE_ADVDATA_FULL_NAME;
    adv_init.advdata.include_appearance     = true;
    adv_init.advdata.flags                  = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    adv_init.config.ble_adv_fast_enabled    = true;
    adv_init.config.ble_adv_fast_interval   = (uint32_t) ( GAP_ADV_INTERVAL_MS / 0.625f );
    adv_init.config.ble_adv_fast_timeout    = (uint32_t) ( GAP_ADV_DURATION_MS / 10.0f );
    adv_init.evt_handler                    = adv_evt_hndl;


    
    /****************************************************************
     *  SHOWING TX POWER LEVEL
     */
    
    int8_t tx_level = 1;
    adv_init.advdata.p_tx_power_level = &tx_level;

    /****************************************************************
     *  SHOWING AVAILABLE SERVICES IN ADVERTISEMENT PACKETS
     */
    
    // Show also available services in advertisement packet
    adv_init.advdata.uuids_complete.p_uuids = (ble_uuid_t*) &m_adv_uuids;
    adv_init.advdata.uuids_complete.uuid_cnt = 2;



    /****************************************************************
    *  ADDING SERVICE DATA TO ADVERTISEMENT PACKET
    */
    #if 0
    uint8_t                        bat_level       = 12;
    ble_advdata_service_data_t     service_data    = {0};

    // Set up service data
    service_data.service_uuid      = BLE_UUID_BATTERY_SERVICE;
    service_data.data.size         = sizeof( bat_level);
    service_data.data.p_data       = (uint8_t*) &bat_level;

    // Add to advertisement data
    adv_init.advdata.p_service_data_array   = &service_data;
    adv_init.advdata.service_data_count     = 1;


    #endif


    /****************************************************************
     *  SETTING UP MANUFACTURER DATA INSIDE ADVERTISEMENT PACKET
     */
    
    #if 0
        ble_advdata_manuf_data_t man_data =
        {
            .company_identifier = 0x00ff,
            .data = 
            {
                .p_data = (uint8_t*) &my_adv_data,
                .size = ADV_DATA_SIZE,
            }
        };

        adv_init.advdata.p_manuf_specific_data = &man_data;
    #endif

        
        
        // Set Long Range Advertisement PHY
        //adv_init.config.ble_adv_primary_phy     = BLE_GAP_PHY_CODED;
        //adv_init.config.ble_adv_secondary_phy   = BLE_GAP_PHY_CODED;
        


    /****************************************************************
     *  SETTING UP CONNECTION INTERVAL RANGE
     */
    
    ble_advdata_conn_int_t slave_conn_int = 
    {
        .min_conn_interval = (uint16_t)( 100 / 1.25 ),        /**< Minimum connection interval, in units of 1.25 ms, range 6 to 3200 (7.5 ms to 4 s). */
        .max_conn_interval = (uint16_t)( 200 / 1.25 ),         /**< Maximum connection interval, in units of 1.25 ms, range 6 to 3200 (7.5 ms to 4 s). The value 0xFFFF indicates no specific maximum. */
    };

    adv_init.advdata.p_slave_conn_int = &slave_conn_int;






    // Init advertisement
    if ( NRF_SUCCESS != ble_advertising_init( &m_advertising, &adv_init ))
    {
        // Further actions on error... 
        error_handler(); 
    }
    
    // Setup advertising config tag
    ble_advertising_conn_cfg_tag_set( &m_advertising, BLE_CONN_CFG_TAG );

